Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.ipfile will be created
  + resource "local_file" "ipfile" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./comment.txt"
      + id                   = (known after apply)
    }

  # openstack_compute_floatingip_associate_v2.node_ips will be created
  + resource "openstack_compute_floatingip_associate_v2" "node_ips" {
      + floating_ip = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
    }

  # openstack_compute_floatingip_v2.ip will be created
  + resource "openstack_compute_floatingip_v2" "ip" {
      + address     = (known after apply)
      + fixed_ip    = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + pool        = "public"
      + region      = (known after apply)
    }

  # openstack_compute_instance_v2.node will be created
  + resource "openstack_compute_instance_v2" "node" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "JS-API-Featured-Ubuntu20-Latest"
      + key_pair            = "ks-cluster"
      + name                = "ks-github-terraform-bot"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = (known after apply)
      + stop_before_destroy = false

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "ks-network"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_networking_secgroup_rule_v2.egress_ip4 will be created
  + resource "openstack_networking_secgroup_rule_v2" "egress_ip4" {
      + direction         = "egress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = (known after apply)
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = (known after apply)
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ipv4_tcp_public["22"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "ipv4_tcp_public" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 22
      + port_range_min    = 22
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ipv4_tcp_public["443"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "ipv4_tcp_public" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 443
      + port_range_min    = 443
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ipv4_tcp_public["6443"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "ipv4_tcp_public" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 6443
      + port_range_min    = 6443
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ipv4_tcp_public["80"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "ipv4_tcp_public" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 80
      + port_range_min    = 80
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ipv4_tcp_public["8000"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "ipv4_tcp_public" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 8000
      + port_range_min    = 8000
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ipv4_tcp_public["8080"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "ipv4_tcp_public" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 8080
      + port_range_min    = 8080
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_rule_v2.ipv4_tcp_public["8443"] will be created
  + resource "openstack_networking_secgroup_rule_v2" "ipv4_tcp_public" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 8443
      + port_range_min    = 8443
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # openstack_networking_secgroup_v2.fw will be created
  + resource "openstack_networking_secgroup_v2" "fw" {
      + all_tags             = (known after apply)
      + delete_default_rules = true
      + description          = "[tf] Security group for ks-github-terraform-bot"
      + id                   = (known after apply)
      + name                 = "ks-github-terraform-bot-firewall"
      + region               = (known after apply)
      + tenant_id            = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.